//1 задача
// Console.WriteLine("Введите четверть: ");
// int numberA = Convert.ToInt32(Console.ReadLine());
// if(numberA == 1) {
//     Console.WriteLine("x>0 " + "y>0");
// }
// else if(numberA == 2) {
//     Console.WriteLine("x<0 " + "y>0");
// }
// else if(numberA == 3) {
//     Console.WriteLine("x<0 " + "y<0");
// }
//     else if(numberA == 4){
//     Console.WriteLine("x>0 " + "y<0");
// }
// else Console.WriteLine("Данной четверти не существует!");
 
//2 задача
//Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
// A (3,6); B (2,1) -> 5,09
// A (7,-5); B (1,-1) -> 7,21
// Console.WriteLine("Впишите координаты точки 1: ");
// double AX = Convert.ToInt32(Console.ReadLine());
// double AY = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Впишите координаты точки 2: ");
// double BX = Convert.ToInt32(Console.ReadLine());
// double BY = Convert.ToInt32(Console.ReadLine());
// double CX = (BX-AX)*(BX-AX);
// double CY = (BY-AY)*(BY-AY);
// double result = Math.Sqrt(CX+CY);
// Console.WriteLine(result);
 
//3 задача
// Console.Write("Введите число: ");
// double number = Convert.ToInt32(Console.ReadLine());
// Console.Write(number+"=>");
// for (double i = 1; i <= number; i++)
// {
//     double Math.Pow (i , 2);
//     Console.Write(sum+" ");
// }
